In [1]:
import numpy as np
import pandas as pd

data_one={'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']}
data_two={'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']}
data_three={'E':['E0','E1','E2','E3'],'F':['F0','F1','F2','F3']}

one=pd.DataFrame(data_one)
two=pd.DataFrame(data_two)
one
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [ ]:
# Registration and Login dictionaries for merge on 'name'
registration = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'email': ['alice@email.com', 'bob@email.com', 'charlie@email.com', 'david@email.com'],
    'registration_date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04']
}

login = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'last_login': ['2025-01-20', '2025-01-22', '2025-01-18', '2025-01-25'],
    'login_count': [45, 32, 28, 51]
}

# Convert to DataFrames
df_registration = pd.DataFrame(registration)
df_login = pd.DataFrame(login)

# Inner merge on 'name'
merged_df = pd.merge(df_registration, df_login, on='name', how='inner')
print(merged_df)

In [16]:
# Concate with the column
pd.concat([one,two],axis=1)
# Concate with the row
# joining them with the column make more sense 
# pd.concat([one,two],axis=0)

    A   B   A   B
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [5]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [6]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [8]:
two.columns=one.columns
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [ ]:
myDf=pd.concat([one,two,],axis=0)
myDf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [11]:
myDf.index=range(len(myDf))
myDf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3